Revit 2026 API

# WallRemoveProfileSketch Method

---

Reverts an edited wall to its original shape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveProfileSketch()
```
```vb
Public Sub RemoveProfileSketch
```
```cpp
public:
void RemoveProfileSketch()
```
```fsharp
member RemoveProfileSketch : unit -> unit
```

The wall profile is changed back to its original rectangular profile. All profile changes made in the sketch mode are discarded. To check if wall sketch can be removed call SketchId.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace